---
kind: property
id: P:Autodesk.Revit.DB.IFC.IFCExtrusionCreationData.AllowVerticalOffsetOfBReps
source: html/903dec76-11dd-2302-4a93-e6ea12910f26.htm
---
# Autodesk.Revit.DB.IFC.IFCExtrusionCreationData.AllowVerticalOffsetOfBReps Property

Allows vertical shifting of breps when moving towards the origin.

## Syntax (C#)
```csharp
public bool AllowVerticalOffsetOfBReps { get; set; }
```